name = "황영일"
y = 100
print(name)
print(y)

whatObject = '''
Dont Repeat Your self => 똑같은 작업을 반복하지 말고 언제든 재활용 하세요
도대체 객체지향 이라는 것이 무엇인가요?
현실세계의 사물을 모델링하여 소프트웨어를 설계하고 구현하는 패러다임
class = 객체를 만들기 위한 템플릿
object = 데이터 프로그래밍에 데이터를 담을수 있는 껍데기
1) 객체 : 데이터와 기능을 하나로 묶은 단위
2) 클래스 : 객체를 만들기 위한 설계도 또는 틀
3) 상속 : 부모클래스의 속성과 매서드를 자식클래스가 물려받음
4) 캡슐화 : 객체의 내부 구현을 숨기고 외부에는 필요한 기능만 제공
5) 다형성 : 같은 메서드 이름이 다양한 방식으로 동작할수 있게 하는것
동물의 소리 (멍멍) ,(야옹), (꿀꿀)
'''
print(whatObject)

'''
파이선 변수 
- 자바스크립트와 다르게 var, let, const 사용하지 않음
- 변수명만 사용함
'''